# Data Wrangling

In [1]:
# import libraries
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
# loading titanic dataset using seaborn library
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
# simple operation
(titanic['age']+12).head(10)

0    34.0
1    50.0
2    38.0
3    47.0
4    47.0
5     NaN
6    66.0
7    14.0
8    39.0
9    26.0
Name: age, dtype: float64

- ### Dealing with missing values
  - Try gathering data again
  - Remove column or either row if it doesn't affect the data
  - Replace the missing value:
    - how?
      - Average value of entire column and place it into missing point
      - Replace it with frequency or MODE
      - Replace based on other functions
      - ML algorithm can also be used
      - Leave it like that 
    - why?
      - It is better because no data will be missing
      - Less acurate

In [4]:
# to check where are missing values
titanic.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [5]:
#before removing the column
titanic.shape

(891, 15)

In [6]:
# using dropna() method drop the column which has most missing values i.e ('deck') 
# inplace if kept true it will update the change in original data set
titanic.dropna(subset=['deck'], axis=0, inplace=True)
# after removing the column
titanic.shape

(203, 15)

In [7]:
# the column is removed
titanic.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

In [8]:
# this will drop the remaining columns with null values
titanic.dropna().isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [9]:
titanic.shape

(203, 15)

### Replacing missing values

In [10]:
ti1 = sns.load_dataset('titanic')
ti1.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [11]:
# finding mean (average)
mean = ti1['age'].mean()
mean

29.69911764705882

In [12]:
ti1['age'] = ti1['age'].replace(np.nan, mean)

In [13]:
ti1.isnull().sum()

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [14]:
ti1.dropna(subset=['deck'], axis=0, inplace=True)
ti1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
deck           0
embark_town    2
alive          0
alone          0
dtype: int64

In [15]:
ti1.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [16]:
ti1['embarked'] = ti1['embarked'].replace(np.nan, 'S')
ti1['embark_town'] = ti1['embark_town'].replace(np.nan, 'Southampton')

In [17]:
ti1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64